{
  "format": "layers-model",
  "generatedBy": "keras v2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.6.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_6",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                21,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv1d_6_input"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_6",
              "trainable": true,
              "batch_input_shape": [
                null,
                21,
                3
              ],
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_6",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                2
              ],
              "pool_size": [
                2
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_6",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_12",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_13",
              "trainable": true,
              "dtype": "float32",
              "units": 27,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv1d_6/kernel",
          "shape": [
            3,
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_6/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_12/kernel",
          "shape": [
            576,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_12/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/kernel",
          "shape": [
            128,
            27
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/bias",
          "shape": [
            27
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}